constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       12540;
    }
    outlet
    {
        type            patch;
        nFaces          30;
        startFace       12570;
    }
    symm
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          220;
        startFace       12600;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          240;
        startFace       12820;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12800;
        startFace       13060;
    }
)

// ************************************************************************* //
