system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 1.0;

vertices
(
    (0      0       0) // 0
    (0      0.02    0) // 1
    (0      0.025   0) // 2
    (0.5    0.025   0) // 3
    (0.5    0.02    0) // 4
    (0.51   0.02    0) // 5
    (0.51   0.025   0) // 6
    (1.0    0.025   0) // 7
    (1.0    0.02    0) // 8
    (1.0    0       0) // 9
    (0.51   0       0) // 10
    (0.5    0       0) // 11
   
    (0      0       0.0001)
    (0      0.02    0.0001)
    (0      0.025   0.0001)
    (0.5    0.025   0.0001)
    (0.5    0.02    0.0001)
    (0.51   0.02    0.0001)
    (0.51   0.025   0.0001)
    (1.0    0.025   0.0001)
    (1.0    0.02    0.0001)
    (1.0    0       0.0001)
    (0.51   0       0.0001)
    (0.5    0       0.0001)
);

blocks
(
    hex (0 11 4 1  12 23 16 13) (100 20 1) simpleGrading (0.003607801362 0.0286143273 1) // X: N = 100, len = 0.5, vert for grad = end, delta =  0.0001. Y: N=20, L=0.02, V=end, delat=0.0001 Z: const 
    hex ( 1 4 3 2  13 16 15 14) (100 10 1) 
        simpleGrading (
            0.003607801362             // X: N=100, L=0.5, Vert=end, delta=0.0001. 
            (
              (0.5 0.5 13.2192089)     // Y: 50% y-dir, 50% cells N=10, L=0.005, V=start, delat=0.0001
              (0.5 0.5 0.07564471175)  // Y: 50% y-dir, 50% cells N=10, L=0.005, V=end, delat=0.0001
            )
            1                          // Z: const
        ) 
    hex (11 10 5 4   23 22 17 16) (20 20 1) 
        simpleGrading (
            (
              (0.5 0.5 13.76057904)    // Y: 50% y-dir, 50% cells N=20, L=0.01, V=start, delat=0.0001
              (0.5 0.5 0.07267525625)  // Y: 50% y-dir, 50% cells N=20, L=0.01, V=end, delat=0.0001
            )
            0.0286143273               // Y: N=20, L=0.02, V=end, delat=0.0001 
            1                          // Z: const 
        )
    hex (10 9 8 5   22 21 20 17) (100 20 1) simpleGrading (270.4200698 0.0286143273 1) // X: N=100, L=0.49, Vert=start, delta=0.0001. . Y: N=20, L=0.02, V=end, delat=0.0001 Z: const 
    hex (5 8 7 6   17 20 19 18) (100 10 1) 
        simpleGrading (
            270.4200698                // X: N=100, L=0.99, Vert=start, delta=0.0001.
            (
              (0.5 0.5 13.2192089)     // Y: 50% y-dir, 50% cells N=10, L=0.005, V=start, delat=0.0001
              (0.5 0.5 0.07564471175)  // Y: 50% y-dir, 50% cells N=10, L=0.005, V=end, delat=0.0001
            )
            1                          // Z: const
        )
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 13 12)
            (1 2 14 13)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (9 8 20 21)
            (8 7 19 20)

        );
    }
    symm
    {
        type symmetry;
        faces
        (
            (0 11 23 12)
            (11 10 22 23)
            (10 9 21 22)

        );
    }
    walls
    {
        type wall;
        faces
        (
            (2 3 15 14)
            (3 4 16 15)
            (4 5 17 16)
            (5 6 18 17)
            (6 7 19 18)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 11 4 1)
            (1 4 3 2)
            (11 10 5 4)
            (10 9 8 5)
            (5 8 7 6)
            (12 23 16 13)
            (13 16 15 14)
            (23 22 17 16)
            (22 21 20 17)
            (17 20 19 18)


        );
    }
);
// ************************************************************************* //
